# Для запуска программы, скопируйте код 
# в файл `hello-world.go` и
# выполните команду `go run`.
$ go run hello-world.go
hello world

# Иногда мы хотим собрать наши программы 
# в исполняемые файлы. Мы можем сделать 
# это выполнив команду `go build`.
$ go build hello-world.go
$ ls
hello-world	hello-world.go

# Теперь мы можем выполнить 
# наш исполняемый файл напрямую.
$ ./hello-world
hello world

# Теперь, когда мы можем запускать 
# и писать простые программы на Go,
# давайте узнаем об этом языке больше.