// Go имеет различные типы данных, такие как строки,
// целые числа, числа с плавающей запятой,
// булев тип, и так далее.
// Вот несколько основных примеров.

package main

import "fmt"

func main() {

    // Строки, которые можно объединять с помощью `+`.
    fmt.Println("go" + "lang")

    // Целые числа и числа с плавающей запятой.
    fmt.Println("1+1 =", 1+1)
    fmt.Println("7.0/3.0 =", 7.0/3.0)

    // Булев тип, с логическими операторами true или false, как вы и ожидаете.
    fmt.Println(true && false)
    fmt.Println(true || false)
    fmt.Println(!true)
}
